# pandas tutorial

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [7]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [17]:
ser1 = pd.Series([1,2,3,4],['USA','germa','ussr','poland'])

In [18]:
ser1

USA       1
germa     2
ussr      3
poland    4
dtype: int64

In [19]:
ser2 = pd.Series([1,2,3,4],['USA','italy','ussr','poland'])

In [20]:
ser2

USA       1
italy     2
ussr      3
poland    4
dtype: int64

In [23]:
ser1['poland']

4

In [24]:
ser3 = pd.Series(data = labels)

In [25]:
ser3

0    a
1    b
2    c
dtype: object

In [26]:
ser1 + ser2

USA       2.0
germa     NaN
italy     NaN
poland    8.0
ussr      6.0
dtype: float64

In [27]:
ser2

USA       1
italy     2
ussr      3
poland    4
dtype: int64

# data frames

In [28]:
from numpy.random import randn

In [29]:
np.random.seed(101)

In [30]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [31]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [32]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [40]:
df[['x','y','w']]

          x         y         w
a  0.628133  0.907969  2.706850
b -0.319318 -0.848077  0.651118
c  0.740122  0.528813 -2.018168
d -0.758872 -0.933237  0.188695
e  1.978757  2.605967  0.190794

In [42]:
df['new'] = np.random.randn(5,1)

In [43]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  0.302665
b  0.651118 -0.319318 -0.848077  0.605965  1.693723
c -2.018168  0.740122  0.528813 -0.589001 -1.706086
d  0.188695 -0.758872 -0.933237  0.955057 -1.159119
e  0.190794  1.978757  2.605967  0.683509 -0.134841

In [48]:
drop = df.drop('new',axis = 1,inplace = True)

In [50]:
drop

In [51]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [52]:
df.drop('e',axis = 0)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [53]:
df.shape

(5, 4)

In [54]:
df[['z','x']]

          z         x
a  0.503826  0.628133
b  0.605965 -0.319318
c -0.589001  0.740122
d  0.955057 -0.758872
e  0.683509  1.978757

In [55]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [58]:
df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [60]:
df.iloc[2]

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: c, dtype: float64

In [61]:
df.loc['b','y']

-0.84807698340363147

In [62]:
df.loc[['a','b'],['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

In [63]:
# df 2

In [64]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [65]:
df > 0.5

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d  False  False  False   True
e  False   True   True   True

In [66]:
booldf = df > 0.5

In [67]:
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d       NaN       NaN       NaN  0.955057
e       NaN  1.978757  2.605967  0.683509

In [68]:
df[df>0.5]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d       NaN       NaN       NaN  0.955057
e       NaN  1.978757  2.605967  0.683509

In [69]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [70]:
df['w']>0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [71]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [72]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [73]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [82]:
res = df[df['w']>0]

In [83]:
res

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [84]:
res['x']

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [85]:
df[df['w']>0]['x']

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [86]:
df[df['w']>0.5]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

In [87]:
df[(df['w']>0) and (df['y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [88]:
df[(df['w']>0) & (df['y']>1)]

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [89]:
df[(df['w']>0) | (df['y']>1)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [90]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [91]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [92]:
newInd = 'CA NY WY OR CO'.split()

In [94]:
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [95]:
df['states'] = newInd

In [96]:
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [97]:
df.set_index('states')

               w         x         y         z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [98]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
heir_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(heir_index)

In [112]:
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [113]:
df = pd.DataFrame(randn(6,2),heir_index,['A','B'])

In [114]:
df

                A         B
(G1, 1) -0.610259 -0.755325
(G1, 2) -0.346419  0.147027
(G1, 3) -0.479448  0.558769
(G2, 1)  1.024810 -0.925874
(G2, 2)  1.862864 -1.133817
(G2, 3)  0.610478  0.386030

In [120]:
df.loc[['G2']]

KeyError: "None of [['G2']] are in the [index]"

In [111]:
df.index.names

FrozenList([None])

In [14]:
df = pd.read_csv('saved_df.csv')

In [122]:
d = {'a':[1,2,np.nan],'b':[5,np.nan,5],'c':[5,np.nan,5]}

In [123]:
d

{'a': [1, 2, nan], 'b': [5, nan, 5], 'c': [5, nan, 5]}

In [124]:
df = pd.DataFrame(d)

In [125]:
df

     a    b    c
0  1.0  5.0  5.0
1  2.0  NaN  NaN
2  NaN  5.0  5.0

In [128]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [130]:
df.dropna(thresh = 2)

     a    b    c
0  1.0  5.0  5.0
2  NaN  5.0  5.0

In [131]:
df.fillna(value = 'boom')

      a     b     c
0     1     5     5
1     2  boom  boom
2  boom     5     5

In [132]:
df['a'].fillna(value = df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [133]:
df

     a    b    c
0  1.0  5.0  5.0
1  2.0  NaN  NaN
2  NaN  5.0  5.0

In [4]:
df1 = pd.DataFrame({'a':[1,2,3,4],
                    'b':[1,2,3,4],
                    'c':[1,2,3,4]},
                    index= [1,2,3,4])

In [5]:
df1

   a  b  c
1  1  1  1
2  2  2  2
3  3  3  3
4  4  4  4

In [6]:
df2 = pd.DataFrame({'a':[5,6,7,8],
                    'b':[9,10,11,12],
                    'c':[13,14,15,16]},
                    index = [5,6,7,8])

In [10]:
df3 = pd.DataFrame({'a':[17,18,19,20],
                    'b':[21,22,23,24],
                    'c':[25,26,27,28]},
                    index = [9,10,11,12])

In [11]:
pd.concat([df1,df2,df3])

     a   b   c
1    1   1   1
2    2   2   2
3    3   3   3
4    4   4   4
5    5   9  13
6    6  10  14
7    7  11  15
8    8  12  16
9   17  21  25
10  18  22  26
11  19  23  27
12  20  24  28

In [12]:
pd.concat([df1,df2,df3], axis = 1)

      a    b    c    a     b     c     a     b     c
1   1.0  1.0  1.0  NaN   NaN   NaN   NaN   NaN   NaN
2   2.0  2.0  2.0  NaN   NaN   NaN   NaN   NaN   NaN
3   3.0  3.0  3.0  NaN   NaN   NaN   NaN   NaN   NaN
4   4.0  4.0  4.0  NaN   NaN   NaN   NaN   NaN   NaN
5   NaN  NaN  NaN  5.0   9.0  13.0   NaN   NaN   NaN
6   NaN  NaN  NaN  6.0  10.0  14.0   NaN   NaN   NaN
7   NaN  NaN  NaN  7.0  11.0  15.0   NaN   NaN   NaN
8   NaN  NaN  NaN  8.0  12.0  16.0   NaN   NaN   NaN
9   NaN  NaN  NaN  NaN   NaN   NaN  17.0  21.0  25.0
10  NaN  NaN  NaN  NaN   NaN   NaN  18.0  22.0  26.0
11  NaN  NaN  NaN  NaN   NaN   NaN  19.0  23.0  27.0
12  NaN  NaN  NaN  NaN   NaN   NaN  20.0  24.0  28.0

In [15]:
 df

   country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [16]:
df.head()

   country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [18]:
len(df['Age'].unique())

10

In [19]:
df['Age'].nunique()

9

In [20]:
df['Age'].value_counts()

37.0    1
50.0    1
48.0    1
35.0    1
40.0    1
38.0    1
30.0    1
27.0    1
44.0    1
Name: Age, dtype: int64

In [23]:
df[(df['Age']>30)  & (df['Age'] < 40)]

  country   Age   Salary Purchased
3   Spain  38.0  61000.0        No
5  France  35.0  58000.0       Yes
9  France  37.0  67000.0       Yes

In [25]:
def times2(x):
    return x*2

In [26]:
df['Age'].apply(times2)

0     88.0
1     54.0
2     60.0
3     76.0
4     80.0
5     70.0
6      NaN
7     96.0
8    100.0
9     74.0
Name: Age, dtype: float64

In [28]:
df['Age'].apply(len)

TypeError: object of type 'float' has no len()

In [29]:
df['Age'].apply(lambda x: x*2)

0     88.0
1     54.0
2     60.0
3     76.0
4     80.0
5     70.0
6      NaN
7     96.0
8    100.0
9     74.0
Name: Age, dtype: float64

In [30]:
df

   country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [31]:
df.drop('Salary',axis = 1)

   country   Age Purchased
0   France  44.0        No
1    Spain  27.0       Yes
2  Germany  30.0        No
3    Spain  38.0        No
4  Germany  40.0       Yes
5   France  35.0       Yes
6    Spain   NaN        No
7   France  48.0       Yes
8  Germany  50.0        No
9   France  37.0       Yes

In [32]:
df.columns

Index(['country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [34]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [36]:
df.sort_values(by = 'Age')

   country   Age   Salary Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
5   France  35.0  58000.0       Yes
9   France  37.0  67000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
0   France  44.0  72000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
6    Spain   NaN  52000.0        No

In [37]:
df.isnull()

   country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [38]:
df1

   a  b  c
1  1  1  1
2  2  2  2
3  3  3  3
4  4  4  4

In [40]:
df4 = pd.concat([df1,df2,df3])

In [44]:
df.pivot_table(values = 'C',index = ['a','b'])

KeyError: 'C'

# Data I/O